# Напишите программу, которая считает площадь прямоугольника, спрашивая у пользователя длину двух сторон

length = float(input('Enter the length of the rectangle '))
width = float(input('Enter the width of the rectangle '))

print('The area of the rectangle is equal to {}'.format(length * width))
